renatosoriano/AUTOSAR-MCAL-Embedded-Upskilling-Bootcamp/Tresos_Workspace/8_HwIoAb_driver/Examples/IoHwAb_Example3_Pots/Autosar/Mcal/Base/header/S32K148_ADC.h
/*
** ###################################################################
**     Processor:           S32K148_M4
**     Compiler:            Keil ARM C/C++ Compiler
**     Reference manual:    S32K1XX RM Rev.14
**     Version:             rev. 1.1, 2022-02-02
**     Build:               b220202
**
**     Abstract:
**         Peripheral Access Layer for S32K148_M4
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2022 NXP
**
**     NXP Confidential. This software is owned or controlled by NXP and may only be
**     used strictly in accordance with the applicable license terms. By expressly
**     accepting such terms or by downloading, installing, activating and/or otherwise
**     using the software, you are agreeing that you have read, and that you agree to
**     comply with and are bound by, such license terms. If you do not agree to be
**     bound by the applicable license terms, then you may not retain, install,
**     activate or otherwise use the software. The production use license in
**     Section 2.3 is expressly granted for this software.
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
** ###################################################################
*/

/*!
 * @file S32K148_ADC.h
 * @version 1.1
 * @date 2022-02-02
 * @brief Peripheral Access Layer for S32K148_ADC
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
* The SoC header defines typedef for all modules.
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
* The SoC header defines macros for all modules and registers.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
* This type qualifier is needed to ensure correct I/O access and addressing.
*/

/* Prevention from multiple including the same memory map */
#if !defined(S32K148_ADC_H_)  /* Check if memory map has not been already included */
#define S32K148_ADC_H_

#include "S32K148_COMMON.h"

/* ----------------------------------------------------------------------------
   -- ADC Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup ADC_Peripheral_Access_Layer ADC Peripheral Access Layer
 * @{
 */

/** ADC - Size of Registers Arrays */
#define ADC_CV_COUNT                              2u
#define ADC_SC1ZZ_COUNT                           16u
#define ADC_RZZ_COUNT                             16u

/** ADC - Register Layout Typedef */
typedef struct {
  __IO uint32_t SC1A;                              /**< ADC Status and Control Register 1, offset: 0x0 */
  __IO uint32_t SC1B;                              /**< ADC Status and Control Register 1, offset: 0x4 */
  __IO uint32_t SC1C;                              /**< ADC Status and Control Register 1, offset: 0x8 */
  __IO uint32_t SC1D;                              /**< ADC Status and Control Register 1, offset: 0xC */
  __IO uint32_t SC1E;                              /**< ADC Status and Control Register 1, offset: 0x10 */
  __IO uint32_t SC1F;                              /**< ADC Status and Control Register 1, offset: 0x14 */
  __IO uint32_t SC1G;                              /**< ADC Status and Control Register 1, offset: 0x18 */
  __IO uint32_t SC1H;                              /**< ADC Status and Control Register 1, offset: 0x1C */
  __IO uint32_t SC1I;                              /**< ADC Status and Control Register 1, offset: 0x20 */
  __IO uint32_t SC1J;                              /**< ADC Status and Control Register 1, offset: 0x24 */
  __IO uint32_t SC1K;                              /**< ADC Status and Control Register 1, offset: 0x28 */
  __IO uint32_t SC1L;                              /**< ADC Status and Control Register 1, offset: 0x2C */
  __IO uint32_t SC1M;                              /**< ADC Status and Control Register 1, offset: 0x30 */
  __IO uint32_t SC1N;                              /**< ADC Status and Control Register 1, offset: 0x34 */
  __IO uint32_t SC1O;                              /**< ADC Status and Control Register 1, offset: 0x38 */
  __IO uint32_t SC1P;                              /**< ADC Status and Control Register 1, offset: 0x3C */
  __IO uint32_t CFG1;                              /**< ADC Configuration Register 1, offset: 0x40 */
  __IO uint32_t CFG2;                              /**< ADC Configuration Register 2, offset: 0x44 */
  __I  uint32_t RA;                                /**< ADC Data Result Registers, offset: 0x48 */
  __I  uint32_t RB;                                /**< ADC Data Result Registers, offset: 0x4C */
  __I  uint32_t RC;                                /**< ADC Data Result Registers, offset: 0x50 */
  __I  uint32_t RD;                                /**< ADC Data Result Registers, offset: 0x54 */
  __I  uint32_t RE;                                /**< ADC Data Result Registers, offset: 0x58 */
  __I  uint32_t RF;                                /**< ADC Data Result Registers, offset: 0x5C */
  __I  uint32_t RG;                                /**< ADC Data Result Registers, offset: 0x60 */
  __I  uint32_t RH;                                /**< ADC Data Result Registers, offset: 0x64 */
  __I  uint32_t RI;                                /**< ADC Data Result Registers, offset: 0x68 */
  __I  uint32_t RJ;                                /**< ADC Data Result Registers, offset: 0x6C */
  __I  uint32_t RK;                                /**< ADC Data Result Registers, offset: 0x70 */
  __I  uint32_t RL;                                /**< ADC Data Result Registers, offset: 0x74 */
  __I  uint32_t RM;                                /**< ADC Data Result Registers, offset: 0x78 */
  __I  uint32_t RN;                                /**< ADC Data Result Registers, offset: 0x7C */
  __I  uint32_t RO;                                /**< ADC Data Result Registers, offset: 0x80 */
  __I  uint32_t RP;                                /**< ADC Data Result Registers, offset: 0x84 */
  __IO uint32_t CV[ADC_CV_COUNT];                  /**< Compare Value Registers, array offset: 0x88, array step: 0x4 */
  __IO uint32_t SC2;                               /**< Status and Control Register 2, offset: 0x90 */
  __IO uint32_t SC3;                               /**< Status and Control Register 3, offset: 0x94 */
  __IO uint32_t BASE_OFS;                          /**< BASE Offset Register, offset: 0x98 */
  __IO uint32_t OFS;                               /**< ADC Offset Correction Register, offset: 0x9C */
  __IO uint32_t USR_OFS;                           /**< USER Offset Correction Register, offset: 0xA0 */
  __IO uint32_t XOFS;                              /**< ADC X Offset Correction Register, offset: 0xA4 */
  __IO uint32_t YOFS;                              /**< ADC Y Offset Correction Register, offset: 0xA8 */
  __IO uint32_t G;                                 /**< ADC Gain Register, offset: 0xAC */
  __IO uint32_t UG;                                /**< ADC User Gain Register, offset: 0xB0 */
  __IO uint32_t CLPS;                              /**< ADC General Calibration Value Register S, offset: 0xB4 */
  __IO uint32_t CLP3;                              /**< ADC Plus-Side General Calibration Value Register 3, offset: 0xB8 */
  __IO uint32_t CLP2;                              /**< ADC Plus-Side General Calibration Value Register 2, offset: 0xBC */
  __IO uint32_t CLP1;                              /**< ADC Plus-Side General Calibration Value Register 1, offset: 0xC0 */
  __IO uint32_t CLP0;                              /**< ADC Plus-Side General Calibration Value Register 0, offset: 0xC4 */
  __IO uint32_t CLPX;                              /**< ADC Plus-Side General Calibration Value Register X, offset: 0xC8 */
  __IO uint32_t CLP9;                              /**< ADC Plus-Side General Calibration Value Register 9, offset: 0xCC */
  __IO uint32_t CLPS_OFS;                          /**< ADC General Calibration Offset Value Register S, offset: 0xD0 */
  __IO uint32_t CLP3_OFS;                          /**< ADC Plus-Side General Calibration Offset Value Register 3, offset: 0xD4 */
  __IO uint32_t CLP2_OFS;                          /**< ADC Plus-Side General Calibration Offset Value Register 2, offset: 0xD8 */
  __IO uint32_t CLP1_OFS;                          /**< ADC Plus-Side General Calibration Offset Value Register 1, offset: 0xDC */
  __IO uint32_t CLP0_OFS;                          /**< ADC Plus-Side General Calibration Offset Value Register 0, offset: 0xE0 */
  __IO uint32_t CLPX_OFS;                          /**< ADC Plus-Side General Calibration Offset Value Register X, offset: 0xE4 */
  __IO uint32_t CLP9_OFS;                          /**< ADC Plus-Side General Calibration Offset Value Register 9, offset: 0xE8 */
  uint8_t RESERVED_0[28];
  __IO uint32_t ASC1A;                             /**< ADC Status and Control Register 1, offset: 0x108 */
  __IO uint32_t ASC1B;                             /**< ADC Status and Control Register 1, offset: 0x10C */
  __IO uint32_t ASC1C;                             /**< ADC Status and Control Register 1, offset: 0x110 */
  __IO uint32_t ASC1D;                             /**< ADC Status and Control Register 1, offset: 0x114 */
  __IO uint32_t ASC1E;                             /**< ADC Status and Control Register 1, offset: 0x118 */
  __IO uint32_t ASC1F;                             /**< ADC Status and Control Register 1, offset: 0x11C */
  __IO uint32_t ASC1G;                             /**< ADC Status and Control Register 1, offset: 0x120 */
  __IO uint32_t ASC1H;                             /**< ADC Status and Control Register 1, offset: 0x124 */
  __IO uint32_t ASC1I;                             /**< ADC Status and Control Register 1, offset: 0x128 */
  __IO uint32_t ASC1J;                             /**< ADC Status and Control Register 1, offset: 0x12C */
  __IO uint32_t ASC1K;                             /**< ADC Status and Control Register 1, offset: 0x130 */
  __IO uint32_t ASC1L;                             /**< ADC Status and Control Register 1, offset: 0x134 */
  __IO uint32_t ASC1M;                             /**< ADC Status and Control Register 1, offset: 0x138 */
  __IO uint32_t ASC1N;                             /**< ADC Status and Control Register 1, offset: 0x13C */
  __IO uint32_t ASC1O;                             /**< ADC Status and Control Register 1, offset: 0x140 */
  __IO uint32_t ASC1P;                             /**< ADC Status and Control Register 1, offset: 0x144 */
  __IO uint32_t SC1[ADC_SC1ZZ_COUNT];              /**< ADC Status and Control Register 1, array offset: 0x148, array step: 0x4 */
  __I  uint32_t ARA;                               /**< ADC Data Result Registers, offset: 0x188 */
  __I  uint32_t ARB;                               /**< ADC Data Result Registers, offset: 0x18C */
  __I  uint32_t ARC;                               /**< ADC Data Result Registers, offset: 0x190 */
  __I  uint32_t ARD;                               /**< ADC Data Result Registers, offset: 0x194 */
  __I  uint32_t ARE;                               /**< ADC Data Result Registers, offset: 0x198 */
  __I  uint32_t ARF;                               /**< ADC Data Result Registers, offset: 0x19C */
  __I  uint32_t ARG;                               /**< ADC Data Result Registers, offset: 0x1A0 */
  __I  uint32_t ARH;                               /**< ADC Data Result Registers, offset: 0x1A4 */
  __I  uint32_t ARI;                               /**< ADC Data Result Registers, offset: 0x1A8 */
  __I  uint32_t ARJ;                               /**< ADC Data Result Registers, offset: 0x1AC */
  __I  uint32_t ARK;                               /**< ADC Data Result Registers, offset: 0x1B0 */
  __I  uint32_t ARL;                               /**< ADC Data Result Registers, offset: 0x1B4 */
  __I  uint32_t ARM;                               /**< ADC Data Result Registers, offset: 0x1B8 */
  __I  uint32_t ARN;                               /**< ADC Data Result Registers, offset: 0x1BC */
  __I  uint32_t ARO;                               /**< ADC Data Result Registers, offset: 0x1C0 */
  __I  uint32_t ARP;                               /**< ADC Data Result Registers, offset: 0x1C4 */
  __I  uint32_t R[ADC_RZZ_COUNT];                  /**< ADC Data Result Registers, array offset: 0x1C8, array step: 0x4 */
} ADC_Type, *ADC_MemMapPtr;

/** Number of instances of the ADC module. */
#define ADC_INSTANCE_COUNT                       (2u)

/* ADC - Peripheral instance base addresses */
/** Peripheral ADC0 base address */
#define IP_ADC0_BASE                             (0x4003B000u)
/** Peripheral ADC0 base pointer */
#define IP_ADC0                                  ((ADC_Type *)IP_ADC0_BASE)
/** Peripheral ADC1 base address */
#define IP_ADC1_BASE                             (0x40027000u)
/** Peripheral ADC1 base pointer */
#define IP_ADC1                                  ((ADC_Type *)IP_ADC1_BASE)
/** Array initializer of ADC peripheral base addresses */
#define IP_ADC_BASE_ADDRS                        { IP_ADC0_BASE, IP_ADC1_BASE }
/** Array initializer of ADC peripheral base pointers */
#define IP_ADC_BASE_PTRS                         { IP_ADC0, IP_ADC1 }

/* ----------------------------------------------------------------------------
   -- ADC Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup ADC_Register_Masks ADC Register Masks
 * @{
 */

/*! @name SC1A - ADC Status and Control Register 1 */
/*! @{ */

#define ADC_SC1A_ADCH_MASK                       (0x3FU)
#define ADC_SC1A_ADCH_SHIFT                      (0U)
#define ADC_SC1A_ADCH_WIDTH                      (6U)
#define ADC_SC1A_ADCH(x)                         (((uint32_t)(((uint32_t)(x)) << ADC_SC1A_ADCH_SHIFT)) & ADC_SC1A_ADCH_MASK)

#define ADC_SC1A_AIEN_MASK                       (0x40U)
#define ADC_SC1A_AIEN_SHIFT                      (6U)
#define ADC_SC1A_AIEN_WIDTH                      (1U)
#define ADC_SC1A_AIEN(x)                         (((uint32_t)(((uint32_t)(x)) << ADC_SC1A_AIEN_SHIFT)) & ADC_SC1A_AIEN_MASK)

#define ADC_SC1A_COCO_MASK                       (0x80U)
#define ADC_SC1A_COCO_SHIFT                      (7U)
#define ADC_SC1A_COCO_WIDTH                      (1U)
#define ADC_SC1A_COCO(x)                         (((uint32_t)(((uint32_t)(x)) << ADC_SC1A_COCO_SHIFT)) & ADC_SC1A_COCO_MASK)
/*! @} */

/*! @name SC1B - ADC Status and Control Register 1 */
/*! @{ */

#define ADC_SC1B_ADCH_MASK                       (0x3FU)
#define ADC_SC1B_ADCH_SHIFT                      (0U)
#define ADC_SC1B_ADCH_WIDTH                      (6U)
#define ADC_SC1B_ADCH(x)                         (((uint32_t)(((uint32_t)(x)) << ADC_SC1B_ADCH_SHIFT)) & ADC_SC1B_ADCH_MASK)

#define ADC_SC1B_AIEN_MASK                       (0x40U)
#define ADC_SC1B_AIEN_SHIFT                      (6U)
#define ADC_SC1B_AIEN_WIDTH                      (1U)
#define ADC_SC1B_AIEN(x)                         (((uint32_t)(((uint32_t)(x)) << ADC_SC1B_AIEN_SHIFT)) & ADC_SC1B_AIEN_MASK)

