renatosoriano/AUTOSAR-MCAL-Embedded-Upskilling-Bootcamp/Tresos_Workspace/8_HwIoAb_driver/Examples/IoHwAb_Example3_Pots/Autosar/Mcal/Base/header/S32K148_ADC.h
#define ADC_SC1B_COCO_MASK                       (0x80U)
#define ADC_SC1B_COCO_SHIFT                      (7U)
#define ADC_SC1B_COCO_WIDTH                      (1U)
#define ADC_SC1B_COCO(x)                         (((uint32_t)(((uint32_t)(x)) << ADC_SC1B_COCO_SHIFT)) & ADC_SC1B_COCO_MASK)
/*! @} */

/*! @name SC1C - ADC Status and Control Register 1 */
/*! @{ */

#define ADC_SC1C_ADCH_MASK                       (0x3FU)
#define ADC_SC1C_ADCH_SHIFT                      (0U)
#define ADC_SC1C_ADCH_WIDTH                      (6U)
#define ADC_SC1C_ADCH(x)                         (((uint32_t)(((uint32_t)(x)) << ADC_SC1C_ADCH_SHIFT)) & ADC_SC1C_ADCH_MASK)

#define ADC_SC1C_AIEN_MASK                       (0x40U)
#define ADC_SC1C_AIEN_SHIFT                      (6U)
#define ADC_SC1C_AIEN_WIDTH                      (1U)
#define ADC_SC1C_AIEN(x)                         (((uint32_t)(((uint32_t)(x)) << ADC_SC1C_AIEN_SHIFT)) & ADC_SC1C_AIEN_MASK)

#define ADC_SC1C_COCO_MASK                       (0x80U)
#define ADC_SC1C_COCO_SHIFT                      (7U)
#define ADC_SC1C_COCO_WIDTH                      (1U)
#define ADC_SC1C_COCO(x)                         (((uint32_t)(((uint32_t)(x)) << ADC_SC1C_COCO_SHIFT)) & ADC_SC1C_COCO_MASK)
/*! @} */

/*! @name SC1D - ADC Status and Control Register 1 */
/*! @{ */

#define ADC_SC1D_ADCH_MASK                       (0x3FU)
#define ADC_SC1D_ADCH_SHIFT                      (0U)
#define ADC_SC1D_ADCH_WIDTH                      (6U)
#define ADC_SC1D_ADCH(x)                         (((uint32_t)(((uint32_t)(x)) << ADC_SC1D_ADCH_SHIFT)) & ADC_SC1D_ADCH_MASK)

#define ADC_SC1D_AIEN_MASK                       (0x40U)
#define ADC_SC1D_AIEN_SHIFT                      (6U)
#define ADC_SC1D_AIEN_WIDTH                      (1U)
#define ADC_SC1D_AIEN(x)                         (((uint32_t)(((uint32_t)(x)) << ADC_SC1D_AIEN_SHIFT)) & ADC_SC1D_AIEN_MASK)

#define ADC_SC1D_COCO_MASK                       (0x80U)
#define ADC_SC1D_COCO_SHIFT                      (7U)
#define ADC_SC1D_COCO_WIDTH                      (1U)
#define ADC_SC1D_COCO(x)                         (((uint32_t)(((uint32_t)(x)) << ADC_SC1D_COCO_SHIFT)) & ADC_SC1D_COCO_MASK)
/*! @} */

/*! @name SC1E - ADC Status and Control Register 1 */
/*! @{ */

#define ADC_SC1E_ADCH_MASK                       (0x3FU)
#define ADC_SC1E_ADCH_SHIFT                      (0U)
#define ADC_SC1E_ADCH_WIDTH                      (6U)
#define ADC_SC1E_ADCH(x)                         (((uint32_t)(((uint32_t)(x)) << ADC_SC1E_ADCH_SHIFT)) & ADC_SC1E_ADCH_MASK)

#define ADC_SC1E_AIEN_MASK                       (0x40U)
#define ADC_SC1E_AIEN_SHIFT                      (6U)
#define ADC_SC1E_AIEN_WIDTH                      (1U)
#define ADC_SC1E_AIEN(x)                         (((uint32_t)(((uint32_t)(x)) << ADC_SC1E_AIEN_SHIFT)) & ADC_SC1E_AIEN_MASK)

#define ADC_SC1E_COCO_MASK                       (0x80U)
#define ADC_SC1E_COCO_SHIFT                      (7U)
#define ADC_SC1E_COCO_WIDTH                      (1U)
#define ADC_SC1E_COCO(x)                         (((uint32_t)(((uint32_t)(x)) << ADC_SC1E_COCO_SHIFT)) & ADC_SC1E_COCO_MASK)
/*! @} */

/*! @name SC1F - ADC Status and Control Register 1 */
/*! @{ */

#define ADC_SC1F_ADCH_MASK                       (0x3FU)
#define ADC_SC1F_ADCH_SHIFT                      (0U)
#define ADC_SC1F_ADCH_WIDTH                      (6U)
#define ADC_SC1F_ADCH(x)                         (((uint32_t)(((uint32_t)(x)) << ADC_SC1F_ADCH_SHIFT)) & ADC_SC1F_ADCH_MASK)

#define ADC_SC1F_AIEN_MASK                       (0x40U)
#define ADC_SC1F_AIEN_SHIFT                      (6U)
#define ADC_SC1F_AIEN_WIDTH                      (1U)
#define ADC_SC1F_AIEN(x)                         (((uint32_t)(((uint32_t)(x)) << ADC_SC1F_AIEN_SHIFT)) & ADC_SC1F_AIEN_MASK)

#define ADC_SC1F_COCO_MASK                       (0x80U)
#define ADC_SC1F_COCO_SHIFT                      (7U)
#define ADC_SC1F_COCO_WIDTH                      (1U)
#define ADC_SC1F_COCO(x)                         (((uint32_t)(((uint32_t)(x)) << ADC_SC1F_COCO_SHIFT)) & ADC_SC1F_COCO_MASK)
/*! @} */

/*! @name SC1G - ADC Status and Control Register 1 */
/*! @{ */

#define ADC_SC1G_ADCH_MASK                       (0x3FU)
#define ADC_SC1G_ADCH_SHIFT                      (0U)
#define ADC_SC1G_ADCH_WIDTH                      (6U)
#define ADC_SC1G_ADCH(x)                         (((uint32_t)(((uint32_t)(x)) << ADC_SC1G_ADCH_SHIFT)) & ADC_SC1G_ADCH_MASK)

#define ADC_SC1G_AIEN_MASK                       (0x40U)
#define ADC_SC1G_AIEN_SHIFT                      (6U)
#define ADC_SC1G_AIEN_WIDTH                      (1U)
#define ADC_SC1G_AIEN(x)                         (((uint32_t)(((uint32_t)(x)) << ADC_SC1G_AIEN_SHIFT)) & ADC_SC1G_AIEN_MASK)

#define ADC_SC1G_COCO_MASK                       (0x80U)
#define ADC_SC1G_COCO_SHIFT                      (7U)
#define ADC_SC1G_COCO_WIDTH                      (1U)
#define ADC_SC1G_COCO(x)                         (((uint32_t)(((uint32_t)(x)) << ADC_SC1G_COCO_SHIFT)) & ADC_SC1G_COCO_MASK)
/*! @} */

/*! @name SC1H - ADC Status and Control Register 1 */
/*! @{ */

#define ADC_SC1H_ADCH_MASK                       (0x3FU)
#define ADC_SC1H_ADCH_SHIFT                      (0U)
#define ADC_SC1H_ADCH_WIDTH                      (6U)
#define ADC_SC1H_ADCH(x)                         (((uint32_t)(((uint32_t)(x)) << ADC_SC1H_ADCH_SHIFT)) & ADC_SC1H_ADCH_MASK)

#define ADC_SC1H_AIEN_MASK                       (0x40U)
#define ADC_SC1H_AIEN_SHIFT                      (6U)
#define ADC_SC1H_AIEN_WIDTH                      (1U)
#define ADC_SC1H_AIEN(x)                         (((uint32_t)(((uint32_t)(x)) << ADC_SC1H_AIEN_SHIFT)) & ADC_SC1H_AIEN_MASK)

#define ADC_SC1H_COCO_MASK                       (0x80U)
#define ADC_SC1H_COCO_SHIFT                      (7U)
#define ADC_SC1H_COCO_WIDTH                      (1U)
#define ADC_SC1H_COCO(x)                         (((uint32_t)(((uint32_t)(x)) << ADC_SC1H_COCO_SHIFT)) & ADC_SC1H_COCO_MASK)
/*! @} */

/*! @name SC1I - ADC Status and Control Register 1 */
/*! @{ */

#define ADC_SC1I_ADCH_MASK                       (0x3FU)
#define ADC_SC1I_ADCH_SHIFT                      (0U)
#define ADC_SC1I_ADCH_WIDTH                      (6U)
#define ADC_SC1I_ADCH(x)                         (((uint32_t)(((uint32_t)(x)) << ADC_SC1I_ADCH_SHIFT)) & ADC_SC1I_ADCH_MASK)

#define ADC_SC1I_AIEN_MASK                       (0x40U)
#define ADC_SC1I_AIEN_SHIFT                      (6U)
#define ADC_SC1I_AIEN_WIDTH                      (1U)
#define ADC_SC1I_AIEN(x)                         (((uint32_t)(((uint32_t)(x)) << ADC_SC1I_AIEN_SHIFT)) & ADC_SC1I_AIEN_MASK)

#define ADC_SC1I_COCO_MASK                       (0x80U)
#define ADC_SC1I_COCO_SHIFT                      (7U)
#define ADC_SC1I_COCO_WIDTH                      (1U)
#define ADC_SC1I_COCO(x)                         (((uint32_t)(((uint32_t)(x)) << ADC_SC1I_COCO_SHIFT)) & ADC_SC1I_COCO_MASK)
/*! @} */

/*! @name SC1J - ADC Status and Control Register 1 */
/*! @{ */

#define ADC_SC1J_ADCH_MASK                       (0x3FU)
#define ADC_SC1J_ADCH_SHIFT                      (0U)
#define ADC_SC1J_ADCH_WIDTH                      (6U)
#define ADC_SC1J_ADCH(x)                         (((uint32_t)(((uint32_t)(x)) << ADC_SC1J_ADCH_SHIFT)) & ADC_SC1J_ADCH_MASK)

#define ADC_SC1J_AIEN_MASK                       (0x40U)
#define ADC_SC1J_AIEN_SHIFT                      (6U)
#define ADC_SC1J_AIEN_WIDTH                      (1U)
#define ADC_SC1J_AIEN(x)                         (((uint32_t)(((uint32_t)(x)) << ADC_SC1J_AIEN_SHIFT)) & ADC_SC1J_AIEN_MASK)

