renatosoriano/AUTOSAR-MCAL-Embedded-Upskilling-Bootcamp/Tresos_Workspace/8_HwIoAb_driver/Examples/IoHwAb_Example3_Pots/Autosar/Mcal/Base/header/S32K148_ADC.h
#define ADC_CFG1_ADIV_MASK                       (0x60U)
#define ADC_CFG1_ADIV_SHIFT                      (5U)
#define ADC_CFG1_ADIV_WIDTH                      (2U)
#define ADC_CFG1_ADIV(x)                         (((uint32_t)(((uint32_t)(x)) << ADC_CFG1_ADIV_SHIFT)) & ADC_CFG1_ADIV_MASK)

#define ADC_CFG1_CLRLTRG_MASK                    (0x100U)
#define ADC_CFG1_CLRLTRG_SHIFT                   (8U)
#define ADC_CFG1_CLRLTRG_WIDTH                   (1U)
#define ADC_CFG1_CLRLTRG(x)                      (((uint32_t)(((uint32_t)(x)) << ADC_CFG1_CLRLTRG_SHIFT)) & ADC_CFG1_CLRLTRG_MASK)
/*! @} */

/*! @name CFG2 - ADC Configuration Register 2 */
/*! @{ */

#define ADC_CFG2_SMPLTS_MASK                     (0xFFU)
#define ADC_CFG2_SMPLTS_SHIFT                    (0U)
#define ADC_CFG2_SMPLTS_WIDTH                    (8U)
#define ADC_CFG2_SMPLTS(x)                       (((uint32_t)(((uint32_t)(x)) << ADC_CFG2_SMPLTS_SHIFT)) & ADC_CFG2_SMPLTS_MASK)
/*! @} */

/*! @name RA - ADC Data Result Registers */
/*! @{ */

#define ADC_RA_D_MASK                            (0xFFFU)
#define ADC_RA_D_SHIFT                           (0U)
#define ADC_RA_D_WIDTH                           (12U)
#define ADC_RA_D(x)                              (((uint32_t)(((uint32_t)(x)) << ADC_RA_D_SHIFT)) & ADC_RA_D_MASK)
/*! @} */

/*! @name RB - ADC Data Result Registers */
/*! @{ */

#define ADC_RB_D_MASK                            (0xFFFU)
#define ADC_RB_D_SHIFT                           (0U)
#define ADC_RB_D_WIDTH                           (12U)
#define ADC_RB_D(x)                              (((uint32_t)(((uint32_t)(x)) << ADC_RB_D_SHIFT)) & ADC_RB_D_MASK)
/*! @} */

/*! @name RC - ADC Data Result Registers */
/*! @{ */

#define ADC_RC_D_MASK                            (0xFFFU)
#define ADC_RC_D_SHIFT                           (0U)
#define ADC_RC_D_WIDTH                           (12U)
#define ADC_RC_D(x)                              (((uint32_t)(((uint32_t)(x)) << ADC_RC_D_SHIFT)) & ADC_RC_D_MASK)
/*! @} */

/*! @name RD - ADC Data Result Registers */
/*! @{ */

#define ADC_RD_D_MASK                            (0xFFFU)
#define ADC_RD_D_SHIFT                           (0U)
#define ADC_RD_D_WIDTH                           (12U)
#define ADC_RD_D(x)                              (((uint32_t)(((uint32_t)(x)) << ADC_RD_D_SHIFT)) & ADC_RD_D_MASK)
/*! @} */

/*! @name RE - ADC Data Result Registers */
/*! @{ */

#define ADC_RE_D_MASK                            (0xFFFU)
#define ADC_RE_D_SHIFT                           (0U)
#define ADC_RE_D_WIDTH                           (12U)
#define ADC_RE_D(x)                              (((uint32_t)(((uint32_t)(x)) << ADC_RE_D_SHIFT)) & ADC_RE_D_MASK)
/*! @} */

/*! @name RF - ADC Data Result Registers */
/*! @{ */

#define ADC_RF_D_MASK                            (0xFFFU)
#define ADC_RF_D_SHIFT                           (0U)
#define ADC_RF_D_WIDTH                           (12U)
#define ADC_RF_D(x)                              (((uint32_t)(((uint32_t)(x)) << ADC_RF_D_SHIFT)) & ADC_RF_D_MASK)
/*! @} */

/*! @name RG - ADC Data Result Registers */
/*! @{ */

#define ADC_RG_D_MASK                            (0xFFFU)
#define ADC_RG_D_SHIFT                           (0U)
#define ADC_RG_D_WIDTH                           (12U)
#define ADC_RG_D(x)                              (((uint32_t)(((uint32_t)(x)) << ADC_RG_D_SHIFT)) & ADC_RG_D_MASK)
/*! @} */

/*! @name RH - ADC Data Result Registers */
/*! @{ */

#define ADC_RH_D_MASK                            (0xFFFU)
#define ADC_RH_D_SHIFT                           (0U)
#define ADC_RH_D_WIDTH                           (12U)
#define ADC_RH_D(x)                              (((uint32_t)(((uint32_t)(x)) << ADC_RH_D_SHIFT)) & ADC_RH_D_MASK)
/*! @} */

/*! @name RI - ADC Data Result Registers */
/*! @{ */

#define ADC_RI_D_MASK                            (0xFFFU)
#define ADC_RI_D_SHIFT                           (0U)
#define ADC_RI_D_WIDTH                           (12U)
#define ADC_RI_D(x)                              (((uint32_t)(((uint32_t)(x)) << ADC_RI_D_SHIFT)) & ADC_RI_D_MASK)
/*! @} */

/*! @name RJ - ADC Data Result Registers */
/*! @{ */

#define ADC_RJ_D_MASK                            (0xFFFU)
#define ADC_RJ_D_SHIFT                           (0U)
#define ADC_RJ_D_WIDTH                           (12U)
#define ADC_RJ_D(x)                              (((uint32_t)(((uint32_t)(x)) << ADC_RJ_D_SHIFT)) & ADC_RJ_D_MASK)
/*! @} */

/*! @name RK - ADC Data Result Registers */
/*! @{ */

#define ADC_RK_D_MASK                            (0xFFFU)
#define ADC_RK_D_SHIFT                           (0U)
#define ADC_RK_D_WIDTH                           (12U)
#define ADC_RK_D(x)                              (((uint32_t)(((uint32_t)(x)) << ADC_RK_D_SHIFT)) & ADC_RK_D_MASK)
/*! @} */

/*! @name RL - ADC Data Result Registers */
/*! @{ */

#define ADC_RL_D_MASK                            (0xFFFU)
#define ADC_RL_D_SHIFT                           (0U)
#define ADC_RL_D_WIDTH                           (12U)
#define ADC_RL_D(x)                              (((uint32_t)(((uint32_t)(x)) << ADC_RL_D_SHIFT)) & ADC_RL_D_MASK)
/*! @} */

/*! @name RM - ADC Data Result Registers */
/*! @{ */

#define ADC_RM_D_MASK                            (0xFFFU)
#define ADC_RM_D_SHIFT                           (0U)
#define ADC_RM_D_WIDTH                           (12U)
#define ADC_RM_D(x)                              (((uint32_t)(((uint32_t)(x)) << ADC_RM_D_SHIFT)) & ADC_RM_D_MASK)
/*! @} */

/*! @name RN - ADC Data Result Registers */
/*! @{ */

#define ADC_RN_D_MASK                            (0xFFFU)
#define ADC_RN_D_SHIFT                           (0U)
#define ADC_RN_D_WIDTH                           (12U)
#define ADC_RN_D(x)                              (((uint32_t)(((uint32_t)(x)) << ADC_RN_D_SHIFT)) & ADC_RN_D_MASK)
/*! @} */

/*! @name RO - ADC Data Result Registers */
/*! @{ */

#define ADC_RO_D_MASK                            (0xFFFU)
#define ADC_RO_D_SHIFT                           (0U)
#define ADC_RO_D_WIDTH                           (12U)
#define ADC_RO_D(x)                              (((uint32_t)(((uint32_t)(x)) << ADC_RO_D_SHIFT)) & ADC_RO_D_MASK)
/*! @} */

/*! @name RP - ADC Data Result Registers */
/*! @{ */

