renatosoriano/AUTOSAR-MCAL-Embedded-Upskilling-Bootcamp/Tresos_Workspace/8_HwIoAb_driver/Examples/IoHwAb_Example3_Pots/Autosar/Mcal/Base/header/S32K148_ADC.h
#define ADC_ASC1A_COCO_MASK                      (0x80U)
#define ADC_ASC1A_COCO_SHIFT                     (7U)
#define ADC_ASC1A_COCO_WIDTH                     (1U)
#define ADC_ASC1A_COCO(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_ASC1A_COCO_SHIFT)) & ADC_ASC1A_COCO_MASK)
/*! @} */

/*! @name ASC1B - ADC Status and Control Register 1 */
/*! @{ */

#define ADC_ASC1B_ADCH_MASK                      (0x3FU)
#define ADC_ASC1B_ADCH_SHIFT                     (0U)
#define ADC_ASC1B_ADCH_WIDTH                     (6U)
#define ADC_ASC1B_ADCH(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_ASC1B_ADCH_SHIFT)) & ADC_ASC1B_ADCH_MASK)

#define ADC_ASC1B_AIEN_MASK                      (0x40U)
#define ADC_ASC1B_AIEN_SHIFT                     (6U)
#define ADC_ASC1B_AIEN_WIDTH                     (1U)
#define ADC_ASC1B_AIEN(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_ASC1B_AIEN_SHIFT)) & ADC_ASC1B_AIEN_MASK)

#define ADC_ASC1B_COCO_MASK                      (0x80U)
#define ADC_ASC1B_COCO_SHIFT                     (7U)
#define ADC_ASC1B_COCO_WIDTH                     (1U)
#define ADC_ASC1B_COCO(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_ASC1B_COCO_SHIFT)) & ADC_ASC1B_COCO_MASK)
/*! @} */

/*! @name ASC1C - ADC Status and Control Register 1 */
/*! @{ */

#define ADC_ASC1C_ADCH_MASK                      (0x3FU)
#define ADC_ASC1C_ADCH_SHIFT                     (0U)
#define ADC_ASC1C_ADCH_WIDTH                     (6U)
#define ADC_ASC1C_ADCH(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_ASC1C_ADCH_SHIFT)) & ADC_ASC1C_ADCH_MASK)

#define ADC_ASC1C_AIEN_MASK                      (0x40U)
#define ADC_ASC1C_AIEN_SHIFT                     (6U)
#define ADC_ASC1C_AIEN_WIDTH                     (1U)
#define ADC_ASC1C_AIEN(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_ASC1C_AIEN_SHIFT)) & ADC_ASC1C_AIEN_MASK)

#define ADC_ASC1C_COCO_MASK                      (0x80U)
#define ADC_ASC1C_COCO_SHIFT                     (7U)
#define ADC_ASC1C_COCO_WIDTH                     (1U)
#define ADC_ASC1C_COCO(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_ASC1C_COCO_SHIFT)) & ADC_ASC1C_COCO_MASK)
/*! @} */

/*! @name ASC1D - ADC Status and Control Register 1 */
/*! @{ */

#define ADC_ASC1D_ADCH_MASK                      (0x3FU)
#define ADC_ASC1D_ADCH_SHIFT                     (0U)
#define ADC_ASC1D_ADCH_WIDTH                     (6U)
#define ADC_ASC1D_ADCH(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_ASC1D_ADCH_SHIFT)) & ADC_ASC1D_ADCH_MASK)

#define ADC_ASC1D_AIEN_MASK                      (0x40U)
#define ADC_ASC1D_AIEN_SHIFT                     (6U)
#define ADC_ASC1D_AIEN_WIDTH                     (1U)
#define ADC_ASC1D_AIEN(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_ASC1D_AIEN_SHIFT)) & ADC_ASC1D_AIEN_MASK)

#define ADC_ASC1D_COCO_MASK                      (0x80U)
#define ADC_ASC1D_COCO_SHIFT                     (7U)
#define ADC_ASC1D_COCO_WIDTH                     (1U)
#define ADC_ASC1D_COCO(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_ASC1D_COCO_SHIFT)) & ADC_ASC1D_COCO_MASK)
/*! @} */

/*! @name ASC1E - ADC Status and Control Register 1 */
/*! @{ */

#define ADC_ASC1E_ADCH_MASK                      (0x3FU)
#define ADC_ASC1E_ADCH_SHIFT                     (0U)
#define ADC_ASC1E_ADCH_WIDTH                     (6U)
#define ADC_ASC1E_ADCH(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_ASC1E_ADCH_SHIFT)) & ADC_ASC1E_ADCH_MASK)

#define ADC_ASC1E_AIEN_MASK                      (0x40U)
#define ADC_ASC1E_AIEN_SHIFT                     (6U)
#define ADC_ASC1E_AIEN_WIDTH                     (1U)
#define ADC_ASC1E_AIEN(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_ASC1E_AIEN_SHIFT)) & ADC_ASC1E_AIEN_MASK)

#define ADC_ASC1E_COCO_MASK                      (0x80U)
#define ADC_ASC1E_COCO_SHIFT                     (7U)
#define ADC_ASC1E_COCO_WIDTH                     (1U)
#define ADC_ASC1E_COCO(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_ASC1E_COCO_SHIFT)) & ADC_ASC1E_COCO_MASK)
/*! @} */

/*! @name ASC1F - ADC Status and Control Register 1 */
/*! @{ */

#define ADC_ASC1F_ADCH_MASK                      (0x3FU)
#define ADC_ASC1F_ADCH_SHIFT                     (0U)
#define ADC_ASC1F_ADCH_WIDTH                     (6U)
#define ADC_ASC1F_ADCH(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_ASC1F_ADCH_SHIFT)) & ADC_ASC1F_ADCH_MASK)

#define ADC_ASC1F_AIEN_MASK                      (0x40U)
#define ADC_ASC1F_AIEN_SHIFT                     (6U)
#define ADC_ASC1F_AIEN_WIDTH                     (1U)
#define ADC_ASC1F_AIEN(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_ASC1F_AIEN_SHIFT)) & ADC_ASC1F_AIEN_MASK)

#define ADC_ASC1F_COCO_MASK                      (0x80U)
#define ADC_ASC1F_COCO_SHIFT                     (7U)
#define ADC_ASC1F_COCO_WIDTH                     (1U)
#define ADC_ASC1F_COCO(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_ASC1F_COCO_SHIFT)) & ADC_ASC1F_COCO_MASK)
/*! @} */

/*! @name ASC1G - ADC Status and Control Register 1 */
/*! @{ */

#define ADC_ASC1G_ADCH_MASK                      (0x3FU)
#define ADC_ASC1G_ADCH_SHIFT                     (0U)
#define ADC_ASC1G_ADCH_WIDTH                     (6U)
#define ADC_ASC1G_ADCH(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_ASC1G_ADCH_SHIFT)) & ADC_ASC1G_ADCH_MASK)

#define ADC_ASC1G_AIEN_MASK                      (0x40U)
#define ADC_ASC1G_AIEN_SHIFT                     (6U)
#define ADC_ASC1G_AIEN_WIDTH                     (1U)
#define ADC_ASC1G_AIEN(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_ASC1G_AIEN_SHIFT)) & ADC_ASC1G_AIEN_MASK)

#define ADC_ASC1G_COCO_MASK                      (0x80U)
#define ADC_ASC1G_COCO_SHIFT                     (7U)
#define ADC_ASC1G_COCO_WIDTH                     (1U)
#define ADC_ASC1G_COCO(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_ASC1G_COCO_SHIFT)) & ADC_ASC1G_COCO_MASK)
/*! @} */

/*! @name ASC1H - ADC Status and Control Register 1 */
/*! @{ */

#define ADC_ASC1H_ADCH_MASK                      (0x3FU)
#define ADC_ASC1H_ADCH_SHIFT                     (0U)
#define ADC_ASC1H_ADCH_WIDTH                     (6U)
#define ADC_ASC1H_ADCH(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_ASC1H_ADCH_SHIFT)) & ADC_ASC1H_ADCH_MASK)

#define ADC_ASC1H_AIEN_MASK                      (0x40U)
#define ADC_ASC1H_AIEN_SHIFT                     (6U)
#define ADC_ASC1H_AIEN_WIDTH                     (1U)
#define ADC_ASC1H_AIEN(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_ASC1H_AIEN_SHIFT)) & ADC_ASC1H_AIEN_MASK)

