renatosoriano/AUTOSAR-MCAL-Embedded-Upskilling-Bootcamp/Tresos_Workspace/8_HwIoAb_driver/Examples/IoHwAb_Example3_Pots/Autosar/Mcal/Base/header/S32K148_ADC.h
#define ADC_ASC1O_ADCH_MASK                      (0x3FU)
#define ADC_ASC1O_ADCH_SHIFT                     (0U)
#define ADC_ASC1O_ADCH_WIDTH                     (6U)
#define ADC_ASC1O_ADCH(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_ASC1O_ADCH_SHIFT)) & ADC_ASC1O_ADCH_MASK)

#define ADC_ASC1O_AIEN_MASK                      (0x40U)
#define ADC_ASC1O_AIEN_SHIFT                     (6U)
#define ADC_ASC1O_AIEN_WIDTH                     (1U)
#define ADC_ASC1O_AIEN(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_ASC1O_AIEN_SHIFT)) & ADC_ASC1O_AIEN_MASK)

#define ADC_ASC1O_COCO_MASK                      (0x80U)
#define ADC_ASC1O_COCO_SHIFT                     (7U)
#define ADC_ASC1O_COCO_WIDTH                     (1U)
#define ADC_ASC1O_COCO(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_ASC1O_COCO_SHIFT)) & ADC_ASC1O_COCO_MASK)
/*! @} */

/*! @name ASC1P - ADC Status and Control Register 1 */
/*! @{ */

#define ADC_ASC1P_ADCH_MASK                      (0x3FU)
#define ADC_ASC1P_ADCH_SHIFT                     (0U)
#define ADC_ASC1P_ADCH_WIDTH                     (6U)
#define ADC_ASC1P_ADCH(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_ASC1P_ADCH_SHIFT)) & ADC_ASC1P_ADCH_MASK)

#define ADC_ASC1P_AIEN_MASK                      (0x40U)
#define ADC_ASC1P_AIEN_SHIFT                     (6U)
#define ADC_ASC1P_AIEN_WIDTH                     (1U)
#define ADC_ASC1P_AIEN(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_ASC1P_AIEN_SHIFT)) & ADC_ASC1P_AIEN_MASK)

#define ADC_ASC1P_COCO_MASK                      (0x80U)
#define ADC_ASC1P_COCO_SHIFT                     (7U)
#define ADC_ASC1P_COCO_WIDTH                     (1U)
#define ADC_ASC1P_COCO(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_ASC1P_COCO_SHIFT)) & ADC_ASC1P_COCO_MASK)
/*! @} */

/*! @name SC1 - ADC Status and Control Register 1 */
/*! @{ */

#define ADC_SC1_ADCH_MASK                        (0x3FU)
#define ADC_SC1_ADCH_SHIFT                       (0U)
#define ADC_SC1_ADCH_WIDTH                       (6U)
#define ADC_SC1_ADCH(x)                          (((uint32_t)(((uint32_t)(x)) << ADC_SC1_ADCH_SHIFT)) & ADC_SC1_ADCH_MASK)

#define ADC_SC1_AIEN_MASK                        (0x40U)
#define ADC_SC1_AIEN_SHIFT                       (6U)
#define ADC_SC1_AIEN_WIDTH                       (1U)
#define ADC_SC1_AIEN(x)                          (((uint32_t)(((uint32_t)(x)) << ADC_SC1_AIEN_SHIFT)) & ADC_SC1_AIEN_MASK)

#define ADC_SC1_COCO_MASK                        (0x80U)
#define ADC_SC1_COCO_SHIFT                       (7U)
#define ADC_SC1_COCO_WIDTH                       (1U)
#define ADC_SC1_COCO(x)                          (((uint32_t)(((uint32_t)(x)) << ADC_SC1_COCO_SHIFT)) & ADC_SC1_COCO_MASK)
/*! @} */

/*! @name ARA - ADC Data Result Registers */
/*! @{ */

#define ADC_ARA_D_MASK                           (0xFFFU)
#define ADC_ARA_D_SHIFT                          (0U)
#define ADC_ARA_D_WIDTH                          (12U)
#define ADC_ARA_D(x)                             (((uint32_t)(((uint32_t)(x)) << ADC_ARA_D_SHIFT)) & ADC_ARA_D_MASK)
/*! @} */

/*! @name ARB - ADC Data Result Registers */
/*! @{ */

#define ADC_ARB_D_MASK                           (0xFFFU)
#define ADC_ARB_D_SHIFT                          (0U)
#define ADC_ARB_D_WIDTH                          (12U)
#define ADC_ARB_D(x)                             (((uint32_t)(((uint32_t)(x)) << ADC_ARB_D_SHIFT)) & ADC_ARB_D_MASK)
/*! @} */

/*! @name ARC - ADC Data Result Registers */
/*! @{ */

#define ADC_ARC_D_MASK                           (0xFFFU)
#define ADC_ARC_D_SHIFT                          (0U)
#define ADC_ARC_D_WIDTH                          (12U)
#define ADC_ARC_D(x)                             (((uint32_t)(((uint32_t)(x)) << ADC_ARC_D_SHIFT)) & ADC_ARC_D_MASK)
/*! @} */

/*! @name ARD - ADC Data Result Registers */
/*! @{ */

#define ADC_ARD_D_MASK                           (0xFFFU)
#define ADC_ARD_D_SHIFT                          (0U)
#define ADC_ARD_D_WIDTH                          (12U)
#define ADC_ARD_D(x)                             (((uint32_t)(((uint32_t)(x)) << ADC_ARD_D_SHIFT)) & ADC_ARD_D_MASK)
/*! @} */

/*! @name ARE - ADC Data Result Registers */
/*! @{ */

#define ADC_ARE_D_MASK                           (0xFFFU)
#define ADC_ARE_D_SHIFT                          (0U)
#define ADC_ARE_D_WIDTH                          (12U)
#define ADC_ARE_D(x)                             (((uint32_t)(((uint32_t)(x)) << ADC_ARE_D_SHIFT)) & ADC_ARE_D_MASK)
/*! @} */

/*! @name ARF - ADC Data Result Registers */
/*! @{ */

#define ADC_ARF_D_MASK                           (0xFFFU)
#define ADC_ARF_D_SHIFT                          (0U)
#define ADC_ARF_D_WIDTH                          (12U)
#define ADC_ARF_D(x)                             (((uint32_t)(((uint32_t)(x)) << ADC_ARF_D_SHIFT)) & ADC_ARF_D_MASK)
/*! @} */

/*! @name ARG - ADC Data Result Registers */
/*! @{ */

#define ADC_ARG_D_MASK                           (0xFFFU)
#define ADC_ARG_D_SHIFT                          (0U)
#define ADC_ARG_D_WIDTH                          (12U)
#define ADC_ARG_D(x)                             (((uint32_t)(((uint32_t)(x)) << ADC_ARG_D_SHIFT)) & ADC_ARG_D_MASK)
/*! @} */

/*! @name ARH - ADC Data Result Registers */
/*! @{ */

#define ADC_ARH_D_MASK                           (0xFFFU)
#define ADC_ARH_D_SHIFT                          (0U)
#define ADC_ARH_D_WIDTH                          (12U)
#define ADC_ARH_D(x)                             (((uint32_t)(((uint32_t)(x)) << ADC_ARH_D_SHIFT)) & ADC_ARH_D_MASK)
/*! @} */

/*! @name ARI - ADC Data Result Registers */
/*! @{ */

#define ADC_ARI_D_MASK                           (0xFFFU)
#define ADC_ARI_D_SHIFT                          (0U)
#define ADC_ARI_D_WIDTH                          (12U)
#define ADC_ARI_D(x)                             (((uint32_t)(((uint32_t)(x)) << ADC_ARI_D_SHIFT)) & ADC_ARI_D_MASK)
/*! @} */

/*! @name ARJ - ADC Data Result Registers */
/*! @{ */

