renatosoriano/AUTOSAR-MCAL-Embedded-Upskilling-Bootcamp/Tresos_Workspace/8_HwIoAb_driver/Examples/IoHwAb_Example3_Pots/Autosar/Mcal/Base/header/S32K148_ADC.h
#define ADC_ARJ_D_MASK                           (0xFFFU)
#define ADC_ARJ_D_SHIFT                          (0U)
#define ADC_ARJ_D_WIDTH                          (12U)
#define ADC_ARJ_D(x)                             (((uint32_t)(((uint32_t)(x)) << ADC_ARJ_D_SHIFT)) & ADC_ARJ_D_MASK)
/*! @} */

/*! @name ARK - ADC Data Result Registers */
/*! @{ */

#define ADC_ARK_D_MASK                           (0xFFFU)
#define ADC_ARK_D_SHIFT                          (0U)
#define ADC_ARK_D_WIDTH                          (12U)
#define ADC_ARK_D(x)                             (((uint32_t)(((uint32_t)(x)) << ADC_ARK_D_SHIFT)) & ADC_ARK_D_MASK)
/*! @} */

/*! @name ARL - ADC Data Result Registers */
/*! @{ */

#define ADC_ARL_D_MASK                           (0xFFFU)
#define ADC_ARL_D_SHIFT                          (0U)
#define ADC_ARL_D_WIDTH                          (12U)
#define ADC_ARL_D(x)                             (((uint32_t)(((uint32_t)(x)) << ADC_ARL_D_SHIFT)) & ADC_ARL_D_MASK)
/*! @} */

/*! @name ARM - ADC Data Result Registers */
/*! @{ */

#define ADC_ARM_D_MASK                           (0xFFFU)
#define ADC_ARM_D_SHIFT                          (0U)
#define ADC_ARM_D_WIDTH                          (12U)
#define ADC_ARM_D(x)                             (((uint32_t)(((uint32_t)(x)) << ADC_ARM_D_SHIFT)) & ADC_ARM_D_MASK)
/*! @} */

/*! @name ARN - ADC Data Result Registers */
/*! @{ */

#define ADC_ARN_D_MASK                           (0xFFFU)
#define ADC_ARN_D_SHIFT                          (0U)
#define ADC_ARN_D_WIDTH                          (12U)
#define ADC_ARN_D(x)                             (((uint32_t)(((uint32_t)(x)) << ADC_ARN_D_SHIFT)) & ADC_ARN_D_MASK)
/*! @} */

/*! @name ARO - ADC Data Result Registers */
/*! @{ */

#define ADC_ARO_D_MASK                           (0xFFFU)
#define ADC_ARO_D_SHIFT                          (0U)
#define ADC_ARO_D_WIDTH                          (12U)
#define ADC_ARO_D(x)                             (((uint32_t)(((uint32_t)(x)) << ADC_ARO_D_SHIFT)) & ADC_ARO_D_MASK)
/*! @} */

/*! @name ARP - ADC Data Result Registers */
/*! @{ */

#define ADC_ARP_D_MASK                           (0xFFFU)
#define ADC_ARP_D_SHIFT                          (0U)
#define ADC_ARP_D_WIDTH                          (12U)
#define ADC_ARP_D(x)                             (((uint32_t)(((uint32_t)(x)) << ADC_ARP_D_SHIFT)) & ADC_ARP_D_MASK)
/*! @} */

/*! @name R - ADC Data Result Registers */
/*! @{ */

#define ADC_R_D_MASK                             (0xFFFU)
#define ADC_R_D_SHIFT                            (0U)
#define ADC_R_D_WIDTH                            (12U)
#define ADC_R_D(x)                               (((uint32_t)(((uint32_t)(x)) << ADC_R_D_SHIFT)) & ADC_R_D_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group ADC_Register_Masks */

/*!
 * @}
 */ /* end of group ADC_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K148_ADC_H_) */
